{"data":{"markdownRemark":{"html":"<p>Probably the most familiar experience of a hardware startup is the lack of monetary resources (free lunches? no way!). And yet, we still want to be cutting edge with our machine learning techniques. Sometimes, doing a custom feature extraction from our datasets can take a lot of computing resources, taking up to 8 hours on a laptop running Linux (notice how I did not say a Macbook Pro). Thankfully, Big Brother Google wants to trickle down some benefits for the needy, and provides us with a Free Tier for a lot of there cloud platform modules. So, I decided to try this out.</p>\n<p>First, I just wrote a simple Python program (testscript.py) that takes more than just a second to run, by doing the forbidden: nested for loops, the Avada Kedavra of programming.</p>\n<pre><code class=\"language-python\">numruns = 300\nprint(\"running\")\nhuge_array = [[[0.0 for i in range(numruns)] for j in range(numruns)] for k in range(numruns)]\ncounter = 0\nprint(\"starting loops\")\nfor i in range(numruns):\n    for j in range(numruns):\n        for k in range(numruns):\n            huge_array[i][j][k] = i+j+k\n            counter+=1\n            if counter%10000 == 0:\n                print(counter)\nprint(\"finished\")\n</code></pre>\n<p>The first thing to do is to create a project on GCP (Google Cloud Platform) by going to console.cloud.google.com and clicking on \"Select a Project\". Once you have named your project, notice you can take advantage of $300 of free credits to play with (how generous!). Once you have made your project, you can click on \"Compute Engine\" on the left hand panel, and create an instance. As of the time this post was written, you can get a free f1-micro instance running on a virtual machine in the US. This f1-micro has 0.6GB of memory and 1vCPU.\n<img src=\"https://raw.githubusercontent.com/simjxu/simjxu.github.io/master/img/gce-dashboard.jpg\" alt=\"gce-f1micro\"></p>\n<p>After this instance is created, you can view your instance and also SSH into the instance. If you do this, then you can interact with this instance via a Debian Linux shell. To upload a file, you can click on the gearbox on the top right side to upload your python file. In my case, I am uploading a python 3 script called testscript.py, which I shared above.\n<img src=\"https://raw.githubusercontent.com/simjxu/simjxu.github.io/master/img/f1micro-SSHshell.jpg\" alt=\"gce-f1microShell\"></p>\n<p>After it is uploaded, you can run the file on the instance by first making it an executable with <code>chmod +x testscript.py</code>. <code>chmod</code> basically changes the mode and using the <code>+x</code> option makes it an executable. Then you can run <code>nohup</code> on the python script to get it running in the shell without requiring the shell to be open. Unfortunately, with the python script I shared, it gets killed after a few seconds:\n<img src=\"https://raw.githubusercontent.com/simjxu/simjxu.github.io/master/img/f1micro-killed.jpg\" alt=\"gce-f1microKilled\"></p>\n<p>Turns out free also means you can't just leave something running forever. If you check the nohup.out file using <code>cat nohup.out</code>, you can see that my script ended somewhere after iteration 523000. Probably exceeded the RAM available here. Probably the better thing to do is to take advantage of another free item, the 5GB of cloud storage. I'll try that next time.</p>\n<p>Useful references: <a href=\"https://cloud.google.com/free/docs/always-free-usage-limits\">https://cloud.google.com/free/docs/always-free-usage-limits</a></p>","frontmatter":{"title":"How to run a Python Script on Google Compute Engine"}}},"pageContext":{"slug":"/posts/googlecomputeengine/"}}